Veldmonster/contiki-mirror/cpu/arm/lm3s9b96/radio/rf230bb/rf230bb.c
/* Track flow through mac, rdc and radio drivers, see contiki-raven-main.c for example of use */
#if DEBUGFLOWSIZE
extern uint8_t debugflowsize,debugflow[DEBUGFLOWSIZE];
#define DEBUGFLOW(c) if (debugflowsize<(DEBUGFLOWSIZE-1)) debugflow[debugflowsize++]=c
#else
#define DEBUGFLOW(c)
#endif

/* XXX hack: these will be made as Chameleon packet attributes */
rtimer_clock_t rf230_time_of_arrival, rf230_time_of_departure;

int rf230_authority_level_of_sender;

#if RF230_CONF_TIMESTAMPS
static rtimer_clock_t setup_time_for_transmission;
static unsigned long total_time_for_transmission, total_transmission_len;
static int num_transmissions;
#endif

#if defined(__AVR_ATmega128RFA1__)
volatile uint8_t rf230_interruptwait,rf230_ccawait;
#endif

uint8_t volatile rf230_pending;

/* RF230 hardware delay times, from datasheet */
typedef enum {
	TIME_TO_ENTER_P_ON = 510, /**<  Transition time from VCC is applied to P_ON - most favorable case! */
	TIME_P_ON_TO_TRX_OFF = 510, /**<  Transition time from P_ON to TRX_OFF. */
	TIME_SLEEP_TO_TRX_OFF = 880, /**<  Transition time from SLEEP to TRX_OFF. */
	TIME_RESET = 6, /**<  Time to hold the RST pin low during reset */
	TIME_ED_MEASUREMENT = 140, /**<  Time it takes to do a ED measurement. */
	TIME_CCA = 140, /**<  Time it takes to do a CCA. */
	TIME_PLL_LOCK = 150, /**<  Maximum time it should take for the PLL to lock. */
	TIME_FTN_TUNING = 25, /**<  Maximum time it should take to do the filter tuning. */
	TIME_NOCLK_TO_WAKE = 6, /**<  Transition time from *_NOCLK to being awake. */
	TIME_CMD_FORCE_TRX_OFF = 1, /**<  Time it takes to execute the FORCE_TRX_OFF command. */
	TIME_TRX_OFF_TO_PLL_ACTIVE = 180, /**<  Transition time from TRX_OFF to: RX_ON, PLL_ON, TX_ARET_ON and RX_AACK_ON. */
	TIME_STATE_TRANSITION_PLL_ACTIVE = 1,
/**<  Transition time from PLL active state to another. */
} radio_trx_timing_t;
/*---------------------------------------------------------------------------*/
PROCESS(rf230_process, "RF230 driver");
/*---------------------------------------------------------------------------*/

static int rf230_read(void *buf, unsigned short bufsize);

static int rf230_prepare(const void *data, unsigned short len);
static int rf230_transmit(unsigned short len);
static int rf230_send(const void *data, unsigned short len);

static int rf230_receiving_packet(void);
static int rf230_pending_packet(void);
static int rf230_cca(void);

uint8_t rf230_last_correlation, rf230_last_rssi, rf230_smallest_rssi;

const struct radio_driver rf230_driver = { rf230_init, rf230_prepare,
		rf230_transmit, rf230_send, rf230_read, rf230_cca, rf230_receiving_packet,
		rf230_pending_packet, rf230_on, rf230_off };

uint8_t RF230_receive_on;
static uint8_t channel;

/* Received frames are buffered to rxframe in the interrupt routine in hal.c */
uint8_t rxframe_head, rxframe_tail;
hal_rx_frame_t rxframe[RF230_CONF_RX_BUFFERS];

/*----------------------------------------------------------------------------*/
/** \brief  This function return the Radio Transceivers current state.
 *
 *  \retval     P_ON               When the external supply voltage (VDD) is
 *                                 first supplied to the transceiver IC, the
 *                                 system is in the P_ON (Poweron) mode.
 *  \retval     BUSY_RX            The radio transceiver is busy receiving a
 *                                 frame.
 *  \retval     BUSY_TX            The radio transceiver is busy transmitting a
 *                                 frame.
 *  \retval     RX_ON              The RX_ON mode enables the analog and digital
 *                                 receiver blocks and the PLL frequency
 *                                 synthesizer.
 *  \retval     TRX_OFF            In this mode, the SPI module and crystal
 *                                 oscillator are active.
 *  \retval     PLL_ON             Entering the PLL_ON mode from TRX_OFF will
 *                                 first enable the analog voltage regulator. The
 *                                 transceiver is ready to transmit a frame.
 *  \retval     BUSY_RX_AACK       The radio was in RX_AACK_ON mode and received
 *                                 the Start of Frame Delimiter (SFD). State
 *                                 transition to BUSY_RX_AACK is done if the SFD
 *                                 is valid.
 *  \retval     BUSY_TX_ARET       The radio transceiver is busy handling the
 *                                 auto retry mechanism.
 *  \retval     RX_AACK_ON         The auto acknowledge mode of the radio is
 *                                 enabled and it is waiting for an incomming
 *                                 frame.
 *  \retval     TX_ARET_ON         The auto retry mechanism is enabled and the
 *                                 radio transceiver is waiting for the user to
 *                                 send the TX_START command.
 *  \retval     RX_ON_NOCLK        The radio transceiver is listening for
 *                                 incomming frames, but the CLKM is disabled so
 *                                 that the controller could be sleeping.
 *                                 However, this is only true if the controller
 *                                 is run from the clock output of the radio.
 *  \retval     RX_AACK_ON_NOCLK   Same as the RX_ON_NOCLK state, but with the
 *                                 auto acknowledge module turned on.
 *  \retval     BUSY_RX_AACK_NOCLK Same as BUSY_RX_AACK, but the controller
 *                                 could be sleeping since the CLKM pin is
 *                                 disabled.
 *  \retval     STATE_TRANSITION   The radio transceiver's state machine is in
 *                                 transition between two states.
 */
static uint8_t radio_get_trx_state(void) {
	return hal_subregister_read(SR_TRX_STATUS);
}

