Veldmonster/contiki-mirror/cpu/arm/lm3s9b96/radio/rf230bb/rf230bb.c
/*----------------------------------------------------------------------------*/
/** \brief  This function checks if the radio transceiver is sleeping.
 *
 *  \retval     true    The radio transceiver is in SLEEP or one of the *_NOCLK
 *                      states.
 *  \retval     false   The radio transceiver is not sleeping.
 */
#if 0
static bool radio_is_sleeping(void)
{
	bool sleeping = false;

	/* The radio transceiver will be at SLEEP or one of the *_NOCLK states only if */
	/* the SLP_TR pin is high. */
	if (hal_get_slptr() != 0) {
		sleeping = true;
	}

	return sleeping;
}
#endif
/*----------------------------------------------------------------------------*/
/** \brief  This function will reset the state machine (to TRX_OFF) from any of
 *          its states, except for the SLEEP state.
 */
static void radio_reset_state_machine(void) {
	if (hal_get_slptr()
		)
		DEBUGFLOW('"');
	hal_set_slptr_low();
	delay_us(TIME_NOCLK_TO_WAKE);
	hal_subregister_write(SR_TRX_CMD, CMD_FORCE_TRX_OFF);
	delay_us(TIME_CMD_FORCE_TRX_OFF);
}
/*---------------------------------------------------------------------------*/
static char rf230_isidle(void) {
	uint8_t radio_state;
	if (hal_get_slptr()) {
		DEBUGFLOW(']');
		return 1;
	} else {
		radio_state = hal_subregister_read(SR_TRX_STATUS);
		if (radio_state != BUSY_TX_ARET && radio_state != BUSY_RX_AACK
				&& radio_state != STATE_TRANSITION && radio_state != BUSY_RX
				&& radio_state != BUSY_TX) {
			return (1);
		} else {
//    printf(".%u",radio_state);
			return (0);
		}
	}
}

static void rf230_waitidle(void) {
	int i;
	for (i = 0; i < 10000; i++) { //to avoid potential hangs
		// while (1) {
		if (rf230_isidle())
			break;
	}
	if (i >= 10000) {
		DEBUGFLOW('H');DEBUGFLOW('R');
	}
}

/*----------------------------------------------------------------------------*/
/** \brief  This function will change the current state of the radio
 *          transceiver's internal state machine.
 *
 *  \param     new_state        Here is a list of possible states:
 *             - RX_ON        Requested transition to RX_ON state.
 *             - TRX_OFF      Requested transition to TRX_OFF state.
 *             - PLL_ON       Requested transition to PLL_ON state.
 *             - RX_AACK_ON   Requested transition to RX_AACK_ON state.
 *             - TX_ARET_ON   Requested transition to TX_ARET_ON state.
 *
 *  \retval    RADIO_SUCCESS          Requested state transition completed
 *                                  successfully.
 *  \retval    RADIO_INVALID_ARGUMENT Supplied function parameter out of bounds.
 *  \retval    RADIO_WRONG_STATE      Illegal state to do transition from.
 *  \retval    RADIO_BUSY_STATE       The radio transceiver is busy.
 *  \retval    RADIO_TIMED_OUT        The state transition could not be completed
 *                                  within resonable time.
 */
static radio_status_t radio_set_trx_state(uint8_t new_state) {
	uint8_t original_state;

	/*Check function paramter and current state of the radio transceiver.*/
	if (!((new_state == TRX_OFF) || (new_state == RX_ON) || (new_state == PLL_ON)
			|| (new_state == RX_AACK_ON) || (new_state == TX_ARET_ON))) {
		return RADIO_INVALID_ARGUMENT;
	}

	if (hal_get_slptr()) {
		return RADIO_WRONG_STATE;
	}

	/* Wait for radio to finish previous operation */
	rf230_waitidle();
	//   for(;;)
	//   {
	original_state = radio_get_trx_state();
	//      if (original_state != BUSY_TX_ARET &&
	//          original_state != BUSY_RX_AACK &&
	//          original_state != BUSY_RX &&
	//          original_state != BUSY_TX)
	//          break;
	//  }

	if (new_state == original_state) {
		return RADIO_SUCCESS;
	}

	/* At this point it is clear that the requested new_state is: */
	/* TRX_OFF, RX_ON, PLL_ON, RX_AACK_ON or TX_ARET_ON. */

	/* The radio transceiver can be in one of the following states: */
	/* TRX_OFF, RX_ON, PLL_ON, RX_AACK_ON, TX_ARET_ON. */
	if (new_state == TRX_OFF) {
		radio_reset_state_machine(); /* Go to TRX_OFF from any state. */
	} else {
		/* It is not allowed to go from RX_AACK_ON or TX_AACK_ON and directly to */
		/* TX_AACK_ON or RX_AACK_ON respectively. Need to go via RX_ON or PLL_ON. */
		if ((new_state == TX_ARET_ON) && (original_state == RX_AACK_ON)) {
			/* First do intermediate state transition to PLL_ON, then to TX_ARET_ON. */
			/* The final state transition to TX_ARET_ON is handled after the if-else if. */
			hal_subregister_write(SR_TRX_CMD, PLL_ON);
			delay_us(TIME_STATE_TRANSITION_PLL_ACTIVE);
		} else if ((new_state == RX_AACK_ON) && (original_state == TX_ARET_ON)) {
			/* First do intermediate state transition to RX_ON, then to RX_AACK_ON. */
			/* The final state transition to RX_AACK_ON is handled after the if-else if. */
			hal_subregister_write(SR_TRX_CMD, RX_ON);
			delay_us(TIME_STATE_TRANSITION_PLL_ACTIVE);
		}

		/* Any other state transition can be done directly. */
		hal_subregister_write(SR_TRX_CMD, new_state);

		/* When the PLL is active most states can be reached in 1us. However, from */
		/* TRX_OFF the PLL needs time to activate. */
		if (original_state == TRX_OFF) {
			delay_us(TIME_TRX_OFF_TO_PLL_ACTIVE);
		} else {
			delay_us(TIME_STATE_TRANSITION_PLL_ACTIVE);
		}
	} /*  end: if(new_state == TRX_OFF) ... */

	/*Verify state transition.*/
	radio_status_t set_state_status = RADIO_TIMED_OUT;

	uint8_t trxState;
	trxState = radio_get_trx_state();
	if (trxState == new_state) {
		set_state_status = RADIO_SUCCESS;
	}

	return set_state_status;
}

void rf230_set_promiscuous_mode(bool isPromiscuous) {
#if RF230_CONF_AUTOACK
	is_promiscuous = isPromiscuous;
	/* TODO: Figure out when to pass promisc state to 802.15.4 */
//    radio_set_trx_state(is_promiscuous?RX_ON:RX_AACK_ON);
#endif
}

bool rf230_is_ready_to_send() {
	switch (radio_get_trx_state()) {
	case BUSY_TX:
	case BUSY_TX_ARET:
		return false;
	}

