Veldmonster/contiki-mirror/cpu/arm/lm3s9b96/radio/rf230bb/rf230bb.c
	return true;
}

static void flushrx(void) {
	rxframe[rxframe_head].length = 0;
}
/*---------------------------------------------------------------------------*/
static uint8_t locked, lock_on, lock_off;

static void on(void) {
//   ENERGEST_OFF(ENERGEST_TYPE_LISTEN);//testing
	ENERGEST_ON(ENERGEST_TYPE_LISTEN);
	RF230_receive_on = 1;
#ifdef RF230BB_HOOK_RADIO_ON
	RF230BB_HOOK_RADIO_ON();
#endif

	/* If radio is off (slptr high), turn it on */
	if (hal_get_slptr()) {
		ENERGEST_ON(ENERGEST_TYPE_LED_RED);
#if RF230BB_CONF_LEDONPORTE1
		PORTE|=(1<<PE1); //ledon
#endif
#if defined(__AVR_ATmega128RFA1__)
		/* Use the poweron interrupt for delay */
		rf230_interruptwait=1;
		sei();
		hal_set_slptr_low();
		while (rf230_interruptwait) {}
#else
		/* SPI based radios. The wake time depends on board capacitance.
		 * Make sure the delay is long enough, as using SPI too soon will reset the MCU!
		 * Use 2x the nominal value for safety. 1.5x is not long enough for Raven!
		 */
//  uint8_t sreg = SREG;cli();
		hal_set_slptr_low();
		delay_us(2 * TIME_SLEEP_TO_TRX_OFF);
//  delay_us(TIME_SLEEP_TO_TRX_OFF+TIME_SLEEP_TO_TRX_OFF/2);
//  SREG=sreg;
#endif
	}

#if RF230_CONF_AUTOACK
	// radio_set_trx_state(is_promiscuous?RX_ON:RX_AACK_ON);
	radio_set_trx_state(RX_AACK_ON);
#else
	radio_set_trx_state(RX_ON);
#endif
	rf230_waitidle();
}
static void off(void) {
#if RF230BB_CONF_LEDONPORTE1
	PORTE&=~(1<<PE1); //ledoff
#endif
#ifdef RF230BB_HOOK_RADIO_OFF
	RF230BB_HOOK_RADIO_OFF();
#endif

	/* Wait for any transmission to end */
	rf230_waitidle();

#if RADIOALWAYSON
	/* Do not transmit autoacks when stack thinks radio is off */
	radio_set_trx_state(RX_ON);
#else
	/* Force the device into TRX_OFF. */
	radio_reset_state_machine();
#if RADIOSLEEPSWHENOFF
	/* Sleep Radio */hal_set_slptr_high();
	ENERGEST_OFF(ENERGEST_TYPE_LED_RED);
#endif
#endif /* RADIOALWAYSON */

	RF230_receive_on = 0;
	ENERGEST_OFF(ENERGEST_TYPE_LISTEN);
}
/*---------------------------------------------------------------------------*/
#define GET_LOCK() locked = 1
static void RELEASE_LOCK(void) {
	if (lock_on) {
		on();
		lock_on = 0;
	}
	if (lock_off) {
		off();
		lock_off = 0;
	}
	locked = 0;
}
/*---------------------------------------------------------------------------*/
static void set_txpower(uint8_t power) {
	if (power > TX_PWR_17_2DBM) {
		power = TX_PWR_17_2DBM;
	}
	if (hal_get_slptr()) {
		DEBUGFLOW('f');PRINTF("rf230_set_txpower:Sleeping"); //happens with cxmac
	} else {
		DEBUGFLOW('g');
		hal_subregister_write(SR_TX_PWR, power);
	}
}
/*----------------------------------------------------------------------------*/
/**
 \brief Calibrate the internal RC oscillator

 This function calibrates the internal RC oscillator, based
 on an external 32KHz crystal connected to TIMER2. In order to
 verify the calibration result you can program the CKOUT fuse
 and monitor the CPU clock on an I/O pin.
 */
#define AVR_ENTER_CRITICAL_REGION( ) {uint8_t volatile saved_sreg = SREG; cli( )
#define AVR_LEAVE_CRITICAL_REGION( ) SREG = saved_sreg;}
uint8_t osccal_original, osccal_calibrated;
void calibrate_rc_osc_32k(void) {
#if 0

	/* Calibrate RC Oscillator: The calibration routine is done by clocking TIMER2
	 * from the external 32kHz crystal while running an internal timer simultaneously.
	 * The internal timer will be clocked at the same speed as the internal RC
	 * oscillator, while TIMER2 is running at 32768 Hz. This way it is not necessary
	 * to use a timed loop, and keep track cycles in timed loop vs. optimization
	 * and compiler.
	 */
	uint8_t osccal_original = OSCCAL;
	volatile uint16_t temp;

	/* Start with current value, which for some MCUs could be in upper or lower range */

//  PRR0 &= ~((1 << PRTIM2)|(1 << PRTIM1)); /*  Enable Timer 1 and 2 */
	TIMSK2 = 0x00; /*  Disable Timer/Counter 2 interrupts. */
	TIMSK1 = 0x00; /*  Disable Timer/Counter 1 interrupts. */

	/* Enable TIMER/COUNTER 2 to be clocked from the external 32kHz clock crystal.
	 * Then wait for the timer to become stable before doing any calibration.
	 */
	ASSR |= (1 << AS2);
	// while (ASSR & ((1 << TCN2UB)|(1 << OCR2AUB)|(1 << TCR2AUB)|(1 << TCR2BUB))) { ; }
	TCCR2B = 1 << CS20; /* run timer 2 at divide by 1 (32KHz) */

	delay_us(50000UL);//crystal takes significant time to stabilize
	AVR_ENTER_CRITICAL_REGION();

	uint8_t counter = 128;
	bool cal_ok = false;
	do {
		/* wait for timer to be ready for updated config */
		TCCR1B = 1 << CS10;

		while (ASSR & ((1 << TCN2UB)|(1 << OCR2AUB)|(1 << TCR2AUB)|(1 << TCR2BUB))) {;}

		TCNT2 = 0x80;
		TCNT1 = 0;

		TIFR2 = 0xFF; /* Clear TIFR2 flags (Yes, really) */

		/* Wait for TIMER/COUNTER 2 to overflow. Stop TIMER/COUNTER 1 and 2, and
		 * read the counter value of TIMER/COUNTER 1. It will now contain the
		 * number of cpu cycles elapsed within the 3906.25 microsecond period.
		 */
		while (!(TIFR2 & (1 << TOV2))) {
			;
		}
		temp = TCNT1;

		TCCR1B = 0;
		/* Defining these as floating point introduces a lot of code and the 256 byte .clz table to RAM */
		/* At 8 MHz we would expect 8*3906.25 = 31250 CPU clocks */
#define cal_upper 32812 //(31250*1.05) // 32812 = 0x802c
#define cal_lower 29687 //(31250*0.95) // 29687 = 0x73f7
		/* Iteratively reduce the error to be within limits */
		if (temp < cal_lower) {
			/* Too slow. Put the hammer down. */
			if (OSCCAL==0x7e) break; //stay in lowest range
			if (OSCCAL==0xff) break;
			OSCCAL++;
		} else if (temp > cal_upper) {
			/* Too fast, retard. */
			if (OSCCAL==0x81) break; //stay in highest range
			if (OSCCAL==0x00) break;
			OSCCAL--;
		} else {
			/* The CPU clock frequency is now within +/- 0.5% of the target value. */
			cal_ok = true;
		}

		counter--;
	}while ((counter != 0) && (false == cal_ok));

	osccal_calibrated=OSCCAL;
	if (true != cal_ok) {
		/* We failed, therefore restore previous OSCCAL value. */
		OSCCAL = osccal_original;
	}

	OSCCAL = osccal_original;
	TCCR2B = 0;

	ASSR &= ~(1 << AS2);

