Veldmonster/contiki-mirror/cpu/arm/lm3s9b96/radio/rf230bb/rf230bb.c
	/* Disable both timers again to save power. */
	//    PRR0 |= (1 << PRTIM2);/* |(1 << PRTIM1); */
	AVR_LEAVE_CRITICAL_REGION();
#endif
}
/*---------------------------------------------------------------------------*/
int rf230_init(void) {
	uint8_t i;
	DEBUGFLOW('i');
	/* A jtag or brownout reset of the mcu tristates the RF230 control pins while
	 * it is in operation, which can result in a mulfunctioning condition when the
	 * radio is later re-initialized.
	 * This manifests as an incorrectly computed hardware FCS checksum.
	 * Setting up the pins before the poweron time delay seems to fix this.
	 */
#if 1  //this works after a brownout or jtag reset
	/* Initialize Hardware Abstraction Layer */
	hal_init();
	/* Wait in case VCC just applied */
	delay_us(TIME_TO_ENTER_P_ON);
#else  //this gives FCS errors 5 out of 6 times
	/* Wait in case VCC just applied */
	delay_us(TIME_TO_ENTER_P_ON);
	/* Initialize Hardware Abstraction Layer */
	hal_init();
#endif

	/* Calibrate oscillator */
	// printf_P(PSTR("\nBefore calibration OSCCAL=%x\n"),OSCCAL);
	// calibrate_rc_osc_32k();
	// printf_P(PSTR("After calibration OSCCAL=%x\n"),OSCCAL);
	/* Set receive buffers empty and point to the first */
	for (i = 0; i < RF230_CONF_RX_BUFFERS; i++)
		rxframe[i].length = 0;
	rxframe_head = 0;
	rxframe_tail = 0;

	/* Do full rf230 Reset */hal_set_rst_low();
	hal_set_slptr_low();
	delay_us(TIME_RESET);
	hal_set_rst_high();

	/* Force transition to TRX_OFF */
	hal_subregister_write(SR_TRX_CMD, CMD_FORCE_TRX_OFF);
	delay_us(TIME_P_ON_TO_TRX_OFF);

	/* Verify that it is a supported version */
	/* Note gcc optimizes this away if DEBUG is not set! */
	//ATMEGA128RFA1 - version 4, ID 31
	uint8_t tvers = hal_register_read(RG_VERSION_NUM);
	uint8_t tmanu = hal_register_read(RG_MAN_ID_0);

	if ((tvers != RF230_REVA) && (tvers != RF230_REVB))
		PRINTF("rf230: Unsupported version %u\n",tvers);
	if (tmanu != SUPPORTED_MANUFACTURER_ID
	)
		PRINTF("rf230: Unsupported manufacturer ID %u\n",tmanu);

	PRINTF("rf230: Version %u, ID %u\n",tvers,tmanu);

	rf230_warm_reset();

	/* Start the packet receive process */
	process_start(&rf230_process, NULL);

	/* Leave radio in on state (?)*/
	on();

	return 1;
}
/*---------------------------------------------------------------------------*/
/* Used to reinitialize radio parameters without losing pan and mac address, channel, power, etc. */
void rf230_warm_reset(void) {
#if RF230_CONF_SNEEZER && JACKDAW
	/* Take jackdaw radio out of test mode */
#warning Manipulating PORTB pins for RF230 Sneezer mode!
	PORTB &= ~(1<<7);
	DDRB &= ~(1<<7);
#endif

	hal_register_write(RG_IRQ_MASK, RF230_SUPPORTED_INTERRUPT_MASK);

	/* Set up number of automatic retries 0-15 (0 implies PLL_ON sends instead of the extended TX_ARET mode */
	hal_subregister_write(SR_MAX_FRAME_RETRIES, RF230_CONF_AUTORETRIES);

	/* Set up carrier sense/clear channel assesment parameters for extended operating mode */
	hal_subregister_write(SR_MAX_CSMA_RETRIES, 5); //highest allowed retries
	hal_register_write(RG_CSMA_BE, 0x80); //min backoff exponent 0, max 8 (highest allowed)
	hal_register_write(RG_CSMA_SEED_0, hal_register_read(RG_PHY_RSSI)); //upper two RSSI reg bits RND_VALUE are random in rf231
	// hal_register_write(CSMA_SEED_1,42 );

	/* CCA Mode Mode 1=Energy above threshold  2=Carrier sense only  3=Both 0=Either (RF231 only) */
//hal_subregister_write(SR_CCA_MODE,1);  //1 is the power-on default
	/* Carrier sense threshold (not implemented in RF230 or RF231) */
// hal_subregister_write(SR_CCA_CS_THRES,1);
	/* Receiver sensitivity. If nonzero rf231/128rfa1 saves 0.5ma in rx mode */
	/* Not implemented on rf230 but does not hurt to write to it */
#ifdef RF230_MIN_RX_POWER
#if RF230_MIN_RX_POWER > 84
#warning rf231 power threshold clipped to -48dBm by hardware register
	hal_register_write(RG_RX_SYN, 0xf);
#elif RF230_MIN_RX_POWER < 0
#error RF230_MIN_RX_POWER can not be negative!
#endif
	hal_register_write(RG_RX_SYN, RF230_MIN_RX_POWER/6 + 1); //1-15 -> -90 to -48dBm
#endif

	/* CCA energy threshold = -91dB + 2*SR_CCA_ED_THRESH. Reset defaults to -77dB */
	/* Use RF230 base of -91;  RF231 base is -90 according to datasheet */
#ifdef RF230_CONF_CCA_THRES
#if RF230_CONF_CCA_THRES < -91
#warning
#warning RF230_CONF_CCA_THRES below hardware limit, setting to -91dBm
#warning
	hal_subregister_write(SR_CCA_ED_THRES,0);
#elif RF230_CONF_CCA_THRES > -61
#warning
#warning RF230_CONF_CCA_THRES above hardware limit, setting to -61dBm
#warning
	hal_subregister_write(SR_CCA_ED_THRES,15);
#else
	hal_subregister_write(SR_CCA_ED_THRES,(RF230_CONF_CCA_THRES+91)/2);
#endif
#endif

	/* Use automatic CRC unless manual is specified */
#if RF230_CONF_CHECKSUM
	hal_subregister_write(SR_TX_AUTO_CRC_ON, 0);
#else
	hal_subregister_write(SR_TX_AUTO_CRC_ON, 1);
#endif

	/* Limit tx power for testing miniature Raven mesh */
#ifdef RF230_MAX_TX_POWER
	set_txpower(RF230_MAX_TX_POWER); //0=3dbm 15=-17.2dbm
#endif
}
/*---------------------------------------------------------------------------*/
static uint8_t buffer[RF230_MAX_TX_FRAME_LENGTH + AUX_LEN];

static int rf230_transmit(unsigned short payload_len) {
	int txpower;
	uint8_t total_len;
	uint8_t radiowason;
	uint8_t tx_result;
#if RF230_CONF_TIMESTAMPS
	struct timestamp timestamp;
#endif /* RF230_CONF_TIMESTAMPS */

	GET_LOCK();

	/* Save receiver state */
	radiowason = RF230_receive_on;

	/* If radio is sleeping we have to turn it on first */
	/* This automatically does the PLL calibrations */
	if (hal_get_slptr()) {
#if defined(__AVR_ATmega128RFA1__)
		if (radiowason) DEBUGFLOW('e');
		radiowason=0;
//	DEBUGFLOW('j');
		ENERGEST_ON(ENERGEST_TYPE_LED_RED);
#if RF230BB_CONF_LEDONPORTE1
		PORTE|=(1<<PE1); //ledon
#endif
		rf230_interruptwait=1;
		hal_set_slptr_low();
//	while (rf230_interruptwait) {}
		{
			int i;
			for (i=0;i<10000;i++) {
				if (!rf230_interruptwait) break;
			}
		}
#else
		hal_set_slptr_low();
		DEBUGFLOW('j');
		delay_us(2 * TIME_SLEEP_TO_TRX_OFF); //extra delay depends on board capacitance
//	delay_us(TIME_SLEEP_TO_TRX_OFF+TIME_SLEEP_TO_TRX_OFF/2);
#endif

	} else {
#if RADIO_CONF_CALIBRATE_INTERVAL
		/* If nonzero, do periodic calibration. See clock.c */
		if (rf230_calibrate) {
			DEBUGFLOW('k');
			hal_subregister_write(SR_PLL_CF_START,1); //takes 80us max
			hal_subregister_write(SR_PLL_DCU_START,1);//takes 6us, concurrently
			rf230_calibrate=0;
			rf230_calibrated=1;
			delay_us(80);//?
		}
#endif
	}

