Veldmonster/contiki-mirror/cpu/arm/lm3s9b96/radio/rf230bb/rf230bb.c
	/* Wait for any previous operation or state transition to finish */
	rf230_waitidle();
	if (RF230_receive_on) {
		ENERGEST_OFF(ENERGEST_TYPE_LISTEN);
	}
	/* Prepare to transmit */
#if RF230_CONF_AUTORETRIES
	radio_set_trx_state(TX_ARET_ON);
	DEBUGFLOW('t');
#else
	radio_set_trx_state(PLL_ON);
	DEBUGFLOW('T');
#endif

	txpower = 0;

	if (packetbuf_attr(PACKETBUF_ATTR_RADIO_TXPOWER) > 0) {
		/* Remember the current transmission power */
		txpower = rf230_get_txpower();
		/* Set the specified transmission power */
		set_txpower(packetbuf_attr(PACKETBUF_ATTR_RADIO_TXPOWER) - 1);
	}

	total_len = payload_len + AUX_LEN;

#if RF230_CONF_TIMESTAMPS
	rtimer_clock_t txtime = timesynch_time();
#endif /* RF230_CONF_TIMESTAMPS */

	ENERGEST_ON(ENERGEST_TYPE_TRANSMIT);

#if defined(__AVR_ATmega128RFA1__)
	/* No interrupts across frame download! */
	cli();
	/* slow down the transmit? */
	//   delay_us(500);
#endif
	/* Toggle the SLP_TR pin to initiate the frame transmission */hal_set_slptr_high();
	hal_set_slptr_low();
	hal_frame_write(buffer, total_len);
#if defined(__AVR_ATmega128RFA1__)
	sei();
#endif
	PRINTF("rf230_transmit:\n");
#if DEBUG>1
	/* Note the dumped packet will have a zero checksum unless compiled with RF230_CONF_CHECKSUM
	 * since we don't know what it will be if calculated by the hardware.
	 */
	{
		uint8_t i;
		PRINTF("0000"); //Start a new wireshark packet
		for (i=0;i<total_len;i++) PRINTF(" %02x",buffer[i]);
		PRINTF("\n");
	}
#endif

#if RADIOSTATS
	RF230_sendpackets++;
#endif

	/* We wait until transmission has ended so that we get an
	 accurate measurement of the transmission time.*/
	rf230_waitidle();

	/* Get the transmission result */
#if RF230_CONF_AUTORETRIES
	tx_result = hal_subregister_read(SR_TRAC_STATUS);
#else
	tx_result=0;
#endif

#ifdef ENERGEST_CONF_LEVELDEVICE_LEVELS
	ENERGEST_OFF_LEVEL(ENERGEST_TYPE_TRANSMIT,rf230_get_txpower());
#endif

	/* Restore the transmission power */
	if (packetbuf_attr(PACKETBUF_ATTR_RADIO_TXPOWER) > 0) {
		set_txpower(txpower & 0xff);
	}

	/* Restore receive mode */
	if (radiowason) {
		DEBUGFLOW('l');
		on();
	} else {
		off();
	}

#if RF230_CONF_TIMESTAMPS
	setup_time_for_transmission = txtime - timestamp.time;

	if(num_transmissions < 10000) {
		total_time_for_transmission += timesynch_time() - txtime;
		total_transmission_len += total_len;
		num_transmissions++;
	}

#endif /* RF230_CONF_TIMESTAMPS */

	ENERGEST_OFF(ENERGEST_TYPE_TRANSMIT);
	if (RF230_receive_on) {
		ENERGEST_ON(ENERGEST_TYPE_LISTEN);
	} else {
#if RADIOALWAYSON
		/* Enable reception */
		on();
#else
		/* Go to lower power TRX_OFF state (turn off PLL) */
		hal_subregister_write(SR_TRX_CMD, CMD_FORCE_TRX_OFF);
#endif
	}

	RELEASE_LOCK();

#if RF230_INSERTACK
	ack_pending = 0;
#endif

	if (tx_result == 1) { //success, data pending from adressee
		tx_result = RADIO_TX_OK; //handle as ordinary success
	}

	if (tx_result == RADIO_TX_OK) {
		RIMESTATS_ADD(lltx);
		if (packetbuf_attr(PACKETBUF_ATTR_RELIABLE))
			RIMESTATS_ADD(ackrx);
		//ack was requested and received
#if RF230_INSERTACK
		/* Not PAN broadcast to FFFF, and ACK was requested and received */
		if (!((buffer[5]==0xff) && (buffer[6]==0xff)) && (buffer[0]&(1<<6)))
		ack_pending=1;
#endif

	} else if (tx_result == 3) { //CSMA channel access failure
		DEBUGFLOW('m');RIMESTATS_ADD(contentiondrop);
		PRINTF("rf230_transmit: Transmission never started\n");
		tx_result = RADIO_TX_COLLISION;
	} else if (tx_result == 5) { //Expected ACK, none received
		DEBUGFLOW('n');
		tx_result = RADIO_TX_NOACK;
		RIMESTATS_ADD(badackrx);
		//ack was requested but not received
	} else if (tx_result == 7) { //Invalid (Can't happen since waited for idle above?)
		DEBUGFLOW('o');
		tx_result = RADIO_TX_ERR;
	}

	return tx_result;
}
/*---------------------------------------------------------------------------*/
static int rf230_prepare(const void *payload, unsigned short payload_len) {
	int ret = 0;
	uint8_t total_len, *pbuf;
#if RF230_CONF_TIMESTAMPS
	struct timestamp timestamp;
#endif
#if RF230_CONF_CHECKSUM
	uint16_t checksum;
#endif
#if RF230_INSERTACK
	/* The sequence number is needed to construct the ack packet */
	ack_seqnum=*(((uint8_t *)payload)+2);
#endif

	GET_LOCK();
	DEBUGFLOW('p');

//  PRINTF("rf230: sending %d bytes\n", payload_len);
//  PRINTSHORT("s%d ",payload_len);

	RIMESTATS_ADD(tx);

#if RF230_CONF_CHECKSUM
	checksum = crc16_data(payload, payload_len, 0);
#endif

	/* Copy payload to RAM buffer */
	total_len = payload_len + AUX_LEN;
	if (total_len > RF230_MAX_TX_FRAME_LENGTH) {
#if RADIOSTATS
		RF230_sendfail++;
#endif
#if DEBUG
		PRINTF("rf230_prepare: packet too large (%d, max: %d)\n",total_len,RF230_MAX_TX_FRAME_LENGTH);
#endif
		ret = -1;
		goto bail;
	}
	pbuf = &buffer[0];
	memcpy(pbuf, payload, payload_len);
	pbuf += payload_len;

#if RF230_CONF_CHECKSUM
	memcpy(pbuf,&checksum,CHECKSUM_LEN);
	pbuf+=CHECKSUM_LEN;
#endif

#if RF230_CONF_TIMESTAMPS
	timestamp.authority_level = timesynch_authority_level();
	timestamp.time = timesynch_time();
	memcpy(pbuf,&timestamp,TIMESTAMP_LEN);
	pbuf+=TIMESTAMP_LEN;
#endif
	/*------------------------------------------------------------*/

#ifdef RF230BB_HOOK_TX_PACKET
#if !RF230_CONF_CHECKSUM
	{ // Add a checksum before we log the packet out
		uint16_t checksum;
		checksum = crc16_data(payload, payload_len, 0);
		memcpy(buffer+total_len-CHECKSUM_LEN,&checksum,CHECKSUM_LEN);
	}
#endif /* RF230_CONF_CHECKSUM */
	RF230BB_HOOK_TX_PACKET(buffer,total_len);
#endif

	bail: RELEASE_LOCK();
	return ret;
}
/*---------------------------------------------------------------------------*/
static int rf230_send(const void *payload, unsigned short payload_len) {
	int ret = 0;

#ifdef RF230BB_HOOK_IS_SEND_ENABLED
	if(!RF230BB_HOOK_IS_SEND_ENABLED()) {
		goto bail;
	}
#endif

