Veldmonster/contiki-mirror/cpu/arm/lm3s9b96/radio/rf230bb/rf230bb.c
	if ((ret = rf230_prepare(payload, payload_len))) {
#if DEBUG
		PRINTF("rf230_send: Unable to send, prep failed (%d)\n",ret);
#endif
		goto bail;
	}

	ret = rf230_transmit(payload_len);

	bail:
#if RADIOSTATS
	if (ret) RF230_sendfail++;
#endif
	return ret;
}
/*---------------------------------------------------------------------------*/
int rf230_off(void) {
	/* Don't do anything if we are already turned off. */
	if (RF230_receive_on == 0) {
		return 0;
	}

	/* If we are called when the driver is locked, we indicate that the
	 radio should be turned off when the lock is unlocked. */
	if (locked) {
		lock_off = 1;
		return 1;
	}

	/* If we are currently receiving a packet
	 we don't actually switch the radio off now, but signal that the
	 driver should switch off the radio once the packet has been
	 received and processed, by setting the 'lock_off' variable. */
	if (!rf230_isidle()) {
		lock_off = 1;
		return 1;
	}

	off();
	return 0;
}
/*---------------------------------------------------------------------------*/
int rf230_on(void) {
	if (RF230_receive_on) {
		DEBUGFLOW('q');
		return 1;
	}
	if (locked) {
		lock_on = 1;
		DEBUGFLOW('r');
		return 1;
	}

	on();
	return 1;
}
/*---------------------------------------------------------------------------*/
uint8_t rf230_get_channel(void) {
//jackdaw reads zero channel, raven reads correct channel?
//return hal_subregister_read(SR_CHANNEL);
	return channel;
}
/*---------------------------------------------------------------------------*/
void rf230_set_channel(uint8_t c) {
	/* Wait for any transmission to end. */
	PRINTF("rf230: Set Channel %u\n",c);
	rf230_waitidle();
	channel = c;
	hal_subregister_write(SR_CHANNEL, c);
}
/*---------------------------------------------------------------------------*/
void rf230_listen_channel(uint8_t c) {
	/* Same as set channel but forces RX_ON state for sniffer or energy scan */
//  PRINTF("rf230: Listen Channel %u\n",c);
	rf230_set_channel(c);
	radio_set_trx_state(RX_ON);
}
/*---------------------------------------------------------------------------*/
void rf230_set_pan_addr(unsigned pan, unsigned addr, const uint8_t ieee_addr[8])
//rf230_set_pan_addr(uint16_t pan,uint16_t addr,uint8_t *ieee_addr)
{
	PRINTF("rf230: PAN=%x Short Addr=%x\n",pan,addr);

	uint8_t abyte;
	abyte = pan & 0xFF;
	hal_register_write(RG_PAN_ID_0, abyte);
	abyte = (pan >> 8 * 1) & 0xFF;
	hal_register_write(RG_PAN_ID_1, abyte);

	abyte = addr & 0xFF;
	hal_register_write(RG_SHORT_ADDR_0, abyte);
	abyte = (addr >> 8 * 1) & 0xFF;
	hal_register_write(RG_SHORT_ADDR_1, abyte);

	if (ieee_addr != NULL) {
		PRINTF("MAC=%x",*ieee_addr);
		hal_register_write(RG_IEEE_ADDR_7, *ieee_addr++);
		PRINTF(":%x",*ieee_addr);
		hal_register_write(RG_IEEE_ADDR_6, *ieee_addr++);
		PRINTF(":%x",*ieee_addr);
		hal_register_write(RG_IEEE_ADDR_5, *ieee_addr++);
		PRINTF(":%x",*ieee_addr);
		hal_register_write(RG_IEEE_ADDR_4, *ieee_addr++);
		PRINTF(":%x",*ieee_addr);
		hal_register_write(RG_IEEE_ADDR_3, *ieee_addr++);
		PRINTF(":%x",*ieee_addr);
		hal_register_write(RG_IEEE_ADDR_2, *ieee_addr++);
		PRINTF(":%x",*ieee_addr);
		hal_register_write(RG_IEEE_ADDR_1, *ieee_addr++);
		PRINTF(":%x",*ieee_addr);
		hal_register_write(RG_IEEE_ADDR_0, *ieee_addr);
		PRINTF("\n");
	}
}
/*---------------------------------------------------------------------------*/
/*
 * Interrupt leaves frame intact in FIFO.
 */
#if RF230_CONF_TIMESTAMPS
static volatile rtimer_clock_t interrupt_time;
static volatile int interrupt_time_set;
#endif /* RF230_CONF_TIMESTAMPS */
#if RF230_TIMETABLE_PROFILING
#define rf230_timetable_size 16
TIMETABLE(rf230_timetable);
TIMETABLE_AGGREGATE(aggregate_time, 10);
#endif /* RF230_TIMETABLE_PROFILING */
int rf230_interrupt(void) {
	/* Poll the receive process, unless the stack thinks the radio is off */
#if RADIOALWAYSON
	if (RF230_receive_on) {
		DEBUGFLOW('+');
#endif
#if RF230_CONF_TIMESTAMPS
	interrupt_time = timesynch_time();
	interrupt_time_set = 1;
#endif /* RF230_CONF_TIMESTAMPS */

	process_poll(&rf230_process);

#if RF230_TIMETABLE_PROFILING
	timetable_clear(&rf230_timetable);
	TIMETABLE_TIMESTAMP(rf230_timetable, "interrupt");
#endif /* RF230_TIMETABLE_PROFILING */

	rf230_pending = 1;

#if RADIOSTATS //TODO:This will double count buffered packets
	RF230_receivepackets++;
#endif
	RIMESTATS_ADD(llrx);

#if RADIOALWAYSON
} else {
	DEBUGFLOW('-');
	rxframe[rxframe_head].length=0;
}
#endif
	return 1;
}
/*---------------------------------------------------------------------------*/
/* Process to handle input packets
 * Receive interrupts cause this process to be polled
 * It calls the core MAC layer which calls rf230_read to get the packet
 * rf230processflag can be printed in the main idle loop for debugging
 */
#if 0
uint8_t rf230processflag;
#define RF230PROCESSFLAG(arg) rf230processflag=arg
#else
#define RF230PROCESSFLAG(arg)
#endif

PROCESS_THREAD(rf230_process, ev, data) {
	int len;
	PROCESS_BEGIN();
		RF230PROCESSFLAG(99);

		while(1) {
			PROCESS_YIELD_UNTIL(ev == PROCESS_EVENT_POLL);
			RF230PROCESSFLAG(42);
#if RF230_TIMETABLE_PROFILING
			TIMETABLE_TIMESTAMP(rf230_timetable, "poll");
#endif /* RF230_TIMETABLE_PROFILING */

			rf230_pending = 0;

			packetbuf_clear();
			len = rf230_read(packetbuf_dataptr(), PACKETBUF_SIZE);
			RF230PROCESSFLAG(1);
			if(len > 0) {
				packetbuf_set_datalen(len);
				RF230PROCESSFLAG(2);
				NETSTACK_RDC.input();
#if RF230_TIMETABLE_PROFILING
				TIMETABLE_TIMESTAMP(rf230_timetable, "end");
				timetable_aggregate_compute_detailed(&aggregate_time,
						&rf230_timetable);
				timetable_clear(&rf230_timetable);
#endif /* RF230_TIMETABLE_PROFILING */
			} else {
#if RADIOSTATS
				RF230_receivefail++;
#endif
			}
		}

		PROCESS_END();
}
/* Get packet from Radio if any, else return zero.
 * The two-byte checksum is appended but the returned length does not include it.
 * Frames are buffered in the interrupt routine so this routine
 * does not access the hardware or change its status.
 */
/*---------------------------------------------------------------------------*/
static int rf230_read(void *buf, unsigned short bufsize) {
	uint8_t len, *framep;
#if FOOTER_LEN
	uint8_t footer[FOOTER_LEN];
#endif
#if RF230_CONF_CHECKSUM
	uint16_t checksum;
#endif
#if RF230_CONF_TIMESTAMPS
	struct timestamp t;
#endif
#if RF230_INSERTACK
	/* Return an ACK to the mac layer */
	if(ack_pending && bufsize == 3) {
		ack_pending=0;
		uint8_t *buff=(uint8_t *)buf;
		buff[0]=2;
		buff[1]=0;
		buff[2]=ack_seqnum;
		return bufsize;
	}
#endif

