Veldmonster/contiki-mirror/cpu/arm/lm3s9b96/radio/rf230bb/rf230bb.c
	/* The length includes the twp-byte checksum but not the LQI byte */
	len = rxframe[rxframe_head].length;
	if (len == 0) {
#if RADIOALWAYSON && DEBUGFLOWSIZE
		if (RF230_receive_on==0) {if (debugflow[debugflowsize-1]!='z') DEBUGFLOW('z');} //cxmac calls with radio off?
#endif
		return 0;
	}

#if RADIOALWAYSON
	if (RF230_receive_on) {
#else
	if (hal_get_slptr()) {
		DEBUGFLOW('!');
		return 0;
	}
	if (!RF230_receive_on) {
		DEBUGFLOW('[');
		return 0;
	}
#endif

#if RF230_CONF_TIMESTAMPS
	if(interrupt_time_set) {
		rf230_time_of_arrival = interrupt_time;
		interrupt_time_set = 0;
	} else {
		rf230_time_of_arrival = 0;
	}
	rf230_time_of_departure = 0;
#endif /* RF230_CONF_TIMESTAMPS */

// PRINTSHORT("r%d",rxframe[rxframe_head].length);  
	PRINTF("rf230_read: %u bytes lqi %u crc %u\n",rxframe[rxframe_head].length,rxframe[rxframe_head].lqi,rxframe[rxframe_head].crc);
#if DEBUG>1
	{
		uint8_t i;
		PRINTF("0000");
		for (i=0;i<rxframe[rxframe_head].length;i++) PRINTF(" %02x",rxframe[rxframe_head].data[i]);
		PRINTF("\n");
	}
#endif

// GET_LOCK();

//if(len > RF230_MAX_PACKET_LEN) {
	if (len > RF230_MAX_TX_FRAME_LENGTH) {
		/* Oops, we must be out of sync. */
		DEBUGFLOW('u');
		flushrx();
		RIMESTATS_ADD(badsynch);
//    RELEASE_LOCK();
		return 0;
	}

	if (len <= AUX_LEN) {
		DEBUGFLOW('s');PRINTF("len <= AUX_LEN\n");
		flushrx();
		RIMESTATS_ADD(tooshort);
		//   RELEASE_LOCK();
		return 0;
	}

	if (len - AUX_LEN > bufsize) {
		DEBUGFLOW('v');PRINTF("len - AUX_LEN > bufsize\n");
		flushrx();
		RIMESTATS_ADD(toolong);
//    RELEASE_LOCK();
		return 0;
	}
	/* Transfer the frame, stripping the footer, but copying the checksum */
	framep = &(rxframe[rxframe_head].data[0]);
	memcpy(buf, framep, len - AUX_LEN + CHECKSUM_LEN);
	rf230_last_correlation = rxframe[rxframe_head].lqi;

	/* Clear the length field to allow buffering of the next packet */
	rxframe[rxframe_head].length = 0;
	rxframe_head++;
	if (rxframe_head >= RF230_CONF_RX_BUFFERS
	)
		rxframe_head = 0;
	/* If another packet has been buffered, schedule another receive poll */
	if (rxframe[rxframe_head].length)
		rf230_interrupt();

	/* Point to the checksum */
	framep += len - AUX_LEN;
#if RF230_CONF_CHECKSUM
	memcpy(&checksum,framep,CHECKSUM_LEN);
#endif /* RF230_CONF_CHECKSUM */
	framep += CHECKSUM_LEN;
#if RF230_CONF_TIMESTAMPS
	memcpy(&t,framep,TIMESTAMP_LEN);
#endif /* RF230_CONF_TIMESTAMPS */
	framep += TIMESTAMP_LEN;
#if FOOTER_LEN
	memcpy(footer,framep,FOOTER_LEN);
#endif
#if RF230_CONF_CHECKSUM
	if(checksum != crc16_data(buf, len - AUX_LEN, 0)) {
		DEBUGFLOW('w');
		PRINTF("checksum failed 0x%04x != 0x%04x\n",
				checksum, crc16_data(buf, len - AUX_LEN, 0));
	}
#if FOOTER_LEN
	if(footer[1] & FOOTER1_CRC_OK &&
			checksum == crc16_data(buf, len - AUX_LEN, 0)) {
#endif
#endif /* RF230_CONF_CHECKSUM */

	/* Get the received signal strength for the packet, 0-84 dB above rx threshold */
#if 0   //more general
	rf230_last_rssi = rf230_get_raw_rssi();
#else   //faster
#if RF230_CONF_AUTOACK
	//   rf230_last_rssi = hal_subregister_read(SR_ED_LEVEL);  //0-84 resolution 1 dB
	rf230_last_rssi = hal_register_read(RG_PHY_ED_LEVEL); //0-84, resolution 1 dB
#else
			/* last_rssi will have been set at RX_START interrupt */
//  rf230_last_rssi = 3*hal_subregister_read(SR_RSSI);    //0-28 resolution 3 dB
#endif
#endif /* speed vs. generality */

	/* Save the smallest rssi. The display routine can reset by setting it to zero */
	if ((rf230_smallest_rssi == 0) || (rf230_last_rssi < rf230_smallest_rssi))
		rf230_smallest_rssi = rf230_last_rssi;

	//   rf230_last_correlation = rxframe[rxframe_head].lqi;
	packetbuf_set_attr(PACKETBUF_ATTR_RSSI, rf230_last_rssi);
	packetbuf_set_attr(PACKETBUF_ATTR_LINK_QUALITY, rf230_last_correlation);

	RIMESTATS_ADD(rx);

#if RF230_CONF_TIMESTAMPS
	rf230_time_of_departure =
	t.time +
	setup_time_for_transmission +
	(total_time_for_transmission * (len - 2)) / total_transmission_len;

	rf230_authority_level_of_sender = t.authority_level;

	packetbuf_set_attr(PACKETBUF_ATTR_TIMESTAMP, t.time);
#endif /* RF230_CONF_TIMESTAMPS */

#if RF230_CONF_CHECKSUM
#if FOOTER_LEN
} else {
	DEBUGFLOW('x');
	PRINTF("bad crc");
	RIMESTATS_ADD(badcrc);
	len = AUX_LEN;
}
#endif
#endif

#ifdef RF230BB_HOOK_RX_PACKET
	RF230BB_HOOK_RX_PACKET(buf,len);
#endif

	/* Here return just the data length. The checksum is however still in the buffer for packet sniffing */
	return len - AUX_LEN;

#if RADIOALWAYSON
} else {
	DEBUGFLOW('y'); //Stack thought radio was off
	return 0;
}
#endif
}
/*---------------------------------------------------------------------------*/
void rf230_set_txpower(uint8_t power) {
	GET_LOCK();
	set_txpower(power);
	RELEASE_LOCK();
}
/*---------------------------------------------------------------------------*/
uint8_t rf230_get_txpower(void) {
	uint8_t power = TX_PWR_UNDEFINED;
	if (hal_get_slptr()) {
		PRINTF("rf230_get_txpower:Sleeping");
	} else {
		power = hal_subregister_read(SR_TX_PWR);
	}
	return power;
}

/*---------------------------------------------------------------------------*/
uint8_t rf230_get_raw_rssi(void) {
	uint8_t rssi, state;
	bool radio_was_off = 0;

	/*The RSSI measurement should only be done in RX_ON or BUSY_RX.*/
	if (!RF230_receive_on) {
		radio_was_off = 1;
		rf230_on();
	}

	/* The energy detect register is used in extended mode (since RSSI will read 0) */
	/* The rssi register is multiplied by 3 to a consistent value from either register */
	state = radio_get_trx_state();
	if ((state == RX_AACK_ON) || (state == BUSY_RX_AACK)) {
		//  rssi = hal_subregister_read(SR_ED_LEVEL);  //0-84, resolution 1 dB
		rssi = hal_register_read(RG_PHY_ED_LEVEL); //0-84, resolution 1 dB
	} else {
#if 0   // 3-clock shift and add is faster on machines with no hardware multiply
		/* avr-gcc may have an -Os bug that uses the general subroutine for multiplying by 3 */
		rssi = hal_subregister_read(SR_RSSI); //0-28, resolution 3 dB
		rssi = (rssi << 1) + rssi;//*3
#else  // 1 or 2 clock multiply, or compiler with correct optimization
		rssi = 3 * hal_subregister_read(SR_RSSI);
#endif

