Veldmonster/contiki-mirror/cpu/arm/lm3s9b96/radio/rf230bb/rf230bb.c
	}

	if (radio_was_off) {
		rf230_off();
	}
	return rssi;
}

/*---------------------------------------------------------------------------*/
static int rf230_cca(void) {
	uint8_t cca = 0;
	uint8_t radio_was_off = 0;

	/* If the radio is locked by an underlying thread (because we are
	 being invoked through an interrupt), we preted that the coast is
	 clear (i.e., no packet is currently being transmitted by a
	 neighbor). */
	if (locked) {
		DEBUGFLOW('|');
		//   return 1; rf230 hangs on occasion?
		return 0;
	}

	/* Turn radio on if necessary. If radio is currently busy return busy channel */
	/* This may happen when testing radio duty cycling with RADIOALWAYSON */
	if (RF230_receive_on) {
		if (hal_get_slptr()) { //should not be sleeping!
			DEBUGFLOW('<');
			goto busyexit;
		} else {
			if (!rf230_isidle()) {
				DEBUGFLOW('2');
				goto busyexit;
			}
		}
	} else {
		radio_was_off = 1;
		rf230_on();
	}

	ENERGEST_ON(ENERGEST_TYPE_LED_YELLOW);
	/* CCA Mode Mode 1=Energy above threshold  2=Carrier sense only  3=Both 0=Either (RF231 only) */
	/* Use the current mode. Note triggering a manual CCA is not recommended in extended mode */
//hal_subregister_write(SR_CCA_MODE,1);
	/* Start the CCA, wait till done, return result */
	/* Note reading the TRX_STATUS register clears both CCA_STATUS and CCA_DONE bits */
#if defined(__AVR_ATmega128RFA1__)
#if 1  //interrupt method
	sei();
//rf230_waitidle();
//TODO:disable reception for version bug
	radio_set_trx_state(RX_ON);
//  rf230_waitidle();
	rf230_ccawait=1;
//CCA_REQUEST is supposed to trigger the interrupt but it doesn't
//  hal_subregister_write(SR_CCA_REQUEST,1);
	hal_register_write(PHY_ED_LEVEL,0);
//  delay_us(TIME_CCA);
//  if (hal_register_read(RG_PHY_ED_LEVEL)<(91-77)) cca=0xff;
	while (rf230_ccawait) {}
#ifdef RF230_CONF_CCA_THRES
	if (hal_register_read(RG_PHY_ED_LEVEL)<(91+RF230_CONF_CCA_THRES) cca=0xff;
#else
			if (hal_register_read(RG_PHY_ED_LEVEL)<(91-77)) cca=0xff;
#endif
//TODO:see if the status register works!
//   cca=hal_register_read(RG_TRX_STATUS);
#if RF230_CONF_AUTOACK
			radio_set_trx_state(RX_AACK_ON);
#endif
#else
			/* If already in receive mode can read the current ED register without delay */
			/* CCA energy threshold = -91dB + 2*SR_CCA_ED_THRESH. Reset defaults to -77dB */
#ifdef RF230_CONF_CCA_THRES
			if (hal_register_read(RG_PHY_ED_LEVEL)<(91+RF230_CONF_CCA_THRES) cca=0xff;
#else
					if (hal_register_read(RG_PHY_ED_LEVEL)<(91-77)) cca=0xff;
#endif
#endif

#else /* RF230, RF231 */
	/* Don't allow interrupts! */
	/* Start the CCA, wait till done, return result */
	/* Note reading the TRX_STATUS register clears both CCA_STATUS and CCA_DONE bits */
	{
		// TODO: Anton - Should lm3s9b96 also disable interrupts?
		//uint8_t volatile saved_sreg = SREG;
		//cli();
		rf230_waitidle();
		hal_subregister_write(SR_CCA_REQUEST, 1);
		delay_us(TIME_CCA);
		while ((cca & 0x80) == 0) {
			cca = hal_register_read(RG_TRX_STATUS);
		}
		//SREG = saved_sreg;
	}
#endif
	ENERGEST_OFF(ENERGEST_TYPE_LED_YELLOW);
	if (radio_was_off) {
		rf230_off();
	}
// if (cca & 0x40) {/*DEBUGFLOW('3')*/;} else {rf230_pending=1;DEBUGFLOW('4');}
	if (cca & 0x40) {
//   DEBUGFLOW('5');
		return 1;
	} else {
//  DEBUGFLOW('6');
		busyexit: return 0;
	}
}
/*---------------------------------------------------------------------------*/
int rf230_receiving_packet(void) {
	uint8_t radio_state;
	if (hal_get_slptr()) {
		DEBUGFLOW('=');
	} else {
		radio_state = hal_subregister_read(SR_TRX_STATUS);
		if ((radio_state == BUSY_RX) || (radio_state == BUSY_RX_AACK)) {
//      DEBUGFLOW('8');
//	  rf230_pending=1;
			return 1;
		}
	}
	return 0;
}
/*---------------------------------------------------------------------------*/
static int rf230_pending_packet(void) {
#if RF230_INSERTACK
	if(ack_pending == 1) return 1;
#endif
	return rf230_pending;
}
/*---------------------------------------------------------------------------*/
#if RF230_CONF_SNEEZER && JACKDAW
/* See A.2 in the datasheet for the sequence needed.
 * This version for RF230 only, hence Jackdaw.
 * A full reset seems not necessary and allows keeping the pan address, etc.
 * for an easy reset back to network mode.
 */
void rf230_start_sneeze(void) {
//write buffer with random data for uniform spectral noise

//uint8_t txpower = hal_register_read(0x05);  //save auto_crc bit and power
//  hal_set_rst_low();
//  hal_set_slptr_low();
//  delay_us(TIME_RESET);
//  hal_set_rst_high();
	hal_register_write(0x0E, 0x01);
	hal_register_write(0x02, 0x03);
	hal_register_write(0x03, 0x10);
	// hal_register_write(0x08, 0x20+26);    //channel 26
	hal_subregister_write(SR_CCA_MODE,1);//leave channel unchanged

	// hal_register_write(0x05, 0x00);       //output power maximum
	hal_subregister_write(SR_TX_AUTO_CRC_ON, 0);//clear AUTO_CRC, leave output power unchanged

	hal_register_read(0x01);//should be trx-off state=0x08
	hal_frame_write(buffer, 127);//maximum length, random for spectral noise

	hal_register_write(0x36,0x0F);//configure continuous TX
	hal_register_write(0x3D,0x00);//Modulated frame, other options are:
//  hal_register_write(RG_TX_2,0x10);    //CW -2MHz
//  hal_register_write(RG_TX_2,0x80);    //CW -500KHz
//  hal_register_write(RG_TX_2,0xC0);    //CW +500KHz

	DDRB |= 1<<7;//Raven USB stick has PB7 connected to the RF230 TST pin.
	PORTB |= 1<<7;//Raise it to enable continuous TX Test Mode.

	hal_register_write(0x02,0x09);//Set TRX_STATE to PLL_ON
	delay_us(TIME_TRX_OFF_TO_PLL_ACTIVE);
	delay_us(TIME_PLL_LOCK);
	delay_us(TIME_PLL_LOCK);
	// while (hal_register_read(0x0f)!=1) {continue;}  //wait for pll lock-hangs
	hal_register_write(0x02,0x02);//Set TRX_STATE to TX_START
}
#endif
